CSI API ETABS v1

# cSapModelPropArea Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropArea PropArea { get; }

    ReadOnly Property PropArea As cPropArea
    	Get

    Dim instance As cSapModel
    Dim value As cPropArea

    value = instance.PropArea

    property cPropArea^ PropArea {
    	cPropArea^ get ();
    }

    abstract PropArea : cPropArea with get

#### Property Value

Type: cPropArea

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com